W8D1/redditclone/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        # we want to find the user with an id = to the id value in the params hash
        # we grab value out of params hash matched with the id key
        # id: params[:id]
        @user = User.find_by(id: params[:id])