W6D3/routes_and_controllers/app/controllers/users_controller.rb

    def index

        # render plain: "I am in the index action"
        user = User.all
---
SELECT "users".* FROM "users"