W7D2/MusicApp/musical_attacks/app/views/bands/index.html.erb


<% Band.all.each do |band|%>
---
SELECT "bands".* FROM "bands"