W7D4/goal_app/goal/app/models/user.rb

    def reset_session_token!
        self.session_token = User.generate_session_token
        self.save
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "-zAYtEHhcHDbEMTQ50X9Hw"], ["updated_at", "2020-03-26 23:51:46.030107"], ["id", 3]]